tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_rcc.h
#define IS_RCC_PLL_DIV(__DIV__)                        (((__DIV__) == RCC_PLL_DIV1)  || ((__DIV__) == RCC_PLL_DIV2))

#if defined(RCC_HSE_SUPPORT)
#define IS_RCC_PLLSOURCE(__SOURCE__)                  (((__SOURCE__) == RCC_PLLSOURCE_HSI) || \
                                                       ((__SOURCE__) == RCC_PLLSOURCE_HSE))
#else
#define IS_RCC_PLLSOURCE(__SOURCE__)                  ((__SOURCE__) == RCC_PLLSOURCE_HSI)
#endif
#endif

#define IS_RCC_HSI(__HSI__)          (((__HSI__) == RCC_HSI_OFF) || ((__HSI__) == RCC_HSI_ON))
/*
#define IS_RCC_HSI_CALIBRATION_VALUE(__VALUE__) (((__VALUE__) == RCC_HSICALIBRATION_8MHz)     || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_24MHz)    || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_48MHz)    || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_64MHz)    || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_72MHz))
*/
#define IS_RCC_HSI_CALIBRATION_VALUE(__VALUE__) (((__VALUE__) == RCC_HSICALIBRATION_8MHz))

#define IS_RCC_HSIDIV(__DIV__)            (((__DIV__) == RCC_HSI_DIV1)  || ((__DIV__) == RCC_HSI_DIV2) || \
                                           ((__DIV__) == RCC_HSI_DIV4)  || ((__DIV__) == RCC_HSI_DIV8) || \
                                           ((__DIV__) == RCC_HSI_DIV16) || ((__DIV__) == RCC_HSI_DIV32)|| \
                                           ((__DIV__) == RCC_HSI_DIV64) || ((__DIV__) == RCC_HSI_DIV128))
                                         
#define IS_RCC_LSI(__LSI__)               (((__LSI__) == RCC_LSI_OFF) || ((__LSI__) == RCC_LSI_ON))

#define IS_RCC_CLOCKTYPE(__CLK__)         ((((__CLK__) & RCC_CLOCKTYPE_ALL) != 0x00UL) && (((__CLK__) & ~RCC_CLOCKTYPE_ALL) == 0x00UL))

#if defined(RCC_PLL_SUPPORT) && defined(RCC_HSE_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#elif defined(RCC_PLL_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#elif defined(RCC_PLL_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#elif defined(RCC_HSE_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#elif defined(RCC_HSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#elif defined(RCC_LSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)   || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#else
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                            ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI))
#endif

#define IS_RCC_HCLK(__HCLK__)             (((__HCLK__) == RCC_SYSCLK_DIV1)   || ((__HCLK__) == RCC_SYSCLK_DIV2)   || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV4)   || ((__HCLK__) == RCC_SYSCLK_DIV8)   || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV16)  || ((__HCLK__) == RCC_SYSCLK_DIV64)  || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV128) || ((__HCLK__) == RCC_SYSCLK_DIV256) || \
                                           ((__HCLK__) == RCC_SYSCLK_DIV512))

#define IS_RCC_PCLK(__PCLK__)             (((__PCLK__) == RCC_HCLK_DIV1) || ((__PCLK__) == RCC_HCLK_DIV2) || \
                                           ((__PCLK__) == RCC_HCLK_DIV4) || ((__PCLK__) == RCC_HCLK_DIV8) || \
                                           ((__PCLK__) == RCC_HCLK_DIV16))
#if defined(RCC_HSE_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE)       || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE)        || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI)        || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV32)  || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV128) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV8))
#elif defined(RCC_HSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE)       || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI)        || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV32)  || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV128) || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV8))
#elif defined(RCC_LSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE)       || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE)        || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI))
#else
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)   (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE)       || \
                                           ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI))
#endif

#define IS_RCC_MCO(__MCOX__)              (((__MCOX__) == RCC_MCO1) || \
                                           ((__MCOX__) == RCC_MCO2) || \
                                           ((__MCOX__) == RCC_MCO3) || \
                                           ((__MCOX__) == RCC_MCO4) || \
                                           ((__MCOX__) == RCC_MCO5) || \
                                           ((__MCOX__) == RCC_MCO6) || \
                                           ((__MCOX__) == RCC_MCO7))

#if defined(RCC_PLL_SUPPORT) && defined(RCC_HSE_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLL)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#elif defined(RCC_PLL_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLL)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#elif defined(RCC_PLL_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PLL)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#elif defined(RCC_HSE_SUPPORT) && defined(RCC_LSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#elif defined(RCC_HSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#elif defined(RCC_LSE_SUPPORT)
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSE)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#else
#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI10M)   || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK)     || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK_UNGATE) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK_UNGATE))
#endif

#define IS_RCC_MCODIV(__DIV__)        (((__DIV__) == RCC_MCODIV_1) || ((__DIV__) == RCC_MCODIV_2)   || \
                                       ((__DIV__) == RCC_MCODIV_4) || ((__DIV__) == RCC_MCODIV_8)   || \
                                       ((__DIV__) == RCC_MCODIV_16)|| ((__DIV__) == RCC_MCODIV_32)  || \
                                       ((__DIV__) == RCC_MCODIV_64)|| ((__DIV__) == RCC_MCODIV_128) || \
                                       ((__DIV__) == RCC_MCODIV_256))
#if defined(RCC_LSE_SUPPORT)
#define IS_RCC_LSE_DRIVE(__DRIVE__)   (((__DRIVE__) == RCC_LSEDRIVE_LOW)      || \
                                       ((__DRIVE__) == RCC_LSEDRIVE_MEDIUM)   || \
                                       ((__DRIVE__) == RCC_LSEDRIVE_HIGH))
#endif
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCC_Exported_Types RCC Exported Types
  * @{
  */
#if defined(RCC_PLL_SUPPORT)
/**
  * @brief  RCC PLL configuration structure definition
  */
typedef struct
{
  uint32_t PLLState;      /*!< PLLState: The new state of the PLL.
                              This parameter can be a value of @ref RCC_PLL_Config */

  uint32_t PLLSource;     /*!< PLLSource: PLL entry clock source.
                              This parameter must be a value of @ref RCC_PLL_Clock_Source */

  uint32_t PLLMUL;        /*!< PLLMUL: Multiplication factor for PLL VCO input clock
                              This parameter must be a value of @ref RCC_PLL_Multiplication_Factor */

  uint32_t PLLDiv;        /*!< The division factor of the PLL.
                              This parameter must be a value of @ref RCC_PLL_Div */
} RCC_PLLInitTypeDef;
#endif
/**
  * @brief  RCC Internal/External Oscillator (HSE, HSI, LSE and LSI) configuration structure definition
  */
typedef struct
{
  uint32_t OscillatorType;       /*!< The oscillators to be configured.
                                      This parameter can be a value of @ref RCC_Oscillator_Type                   */
#if defined(RCC_HSE_SUPPORT)
  uint32_t HSEState;             /*!< The new state of the HSE.
                                      This parameter can be a value of @ref RCC_HSE_Config                        */

