tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_rcc.h
/** @defgroup RCC_System_Clock_Source System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSISYS   RCC_CFGR_SW_HSISYS         /*!< HSISYS used as system clock */
#if defined(RCC_HSE_SUPPORT)
#define RCC_SYSCLKSOURCE_HSE      RCC_CFGR_SW_HSE            /*!< HSE used as system clock */
#endif
#if defined(RCC_PLL_SUPPORT)
#define RCC_SYSCLKSOURCE_PLLCLK   RCC_CFGR_SW_PLL            /*!< PLL used as system clock */
#endif
#define RCC_SYSCLKSOURCE_LSI      RCC_CFGR_SW_LSI            /*!< LSI used as system clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_SYSCLKSOURCE_LSE      RCC_CFGR_SW_LSE            /*!< LSE used as system clock */
#endif
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSISYS   RCC_CFGR_SWS_HSISYS         /*!< HSISYS used as system clock */
#if defined(RCC_HSE_SUPPORT)
#define RCC_SYSCLKSOURCE_STATUS_HSE      RCC_CFGR_SWS_HSE            /*!< HSE used as system clock */
#endif
#if defined(RCC_PLL_SUPPORT)
#define RCC_SYSCLKSOURCE_STATUS_PLLCLK   RCC_CFGR_SWS_PLL            /*!< PLL used as system clock */
#endif
#define RCC_SYSCLKSOURCE_STATUS_LSI      RCC_CFGR_SWS_LSI            /*!< LSI used as system clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_SYSCLKSOURCE_STATUS_LSE      RCC_CFGR_SWS_LSE            /*!< LSE used as system clock */
#endif
/**
  * @}
  */

/** @defgroup RCC_AHB_Clock_Source AHB Clock Source
  * @{
  */
#define RCC_SYSCLK_DIV1                0x00000000U                                                             /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2                RCC_CFGR_HPRE_3                                                         /*!< SYSCLK divided by 2 */
#define RCC_SYSCLK_DIV4                (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_0)                                     /*!< SYSCLK divided by 4 */
#define RCC_SYSCLK_DIV8                (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_1)                                     /*!< SYSCLK divided by 8 */
#define RCC_SYSCLK_DIV16               (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_1 | RCC_CFGR_HPRE_0)                   /*!< SYSCLK divided by 16 */
#define RCC_SYSCLK_DIV64               (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2)                                     /*!< SYSCLK divided by 64 */
#define RCC_SYSCLK_DIV128              (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_0)                   /*!< SYSCLK divided by 128 */
#define RCC_SYSCLK_DIV256              (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_1)                   /*!< SYSCLK divided by 256 */
#define RCC_SYSCLK_DIV512              (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_1 | RCC_CFGR_HPRE_0) /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_APB_Clock_Source APB Clock Source
  * @{
  */
#define RCC_HCLK_DIV1                  0x00000000U                                           /*!< HCLK not divided */
#define RCC_HCLK_DIV2                  RCC_CFGR_PPRE_2                                       /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4                  (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_0)                   /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8                  (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1)                   /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16                 (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1 | RCC_CFGR_PPRE_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCC_RTCCLKSOURCE_NONE          0x00000000U                                                         /*!< No clock configured for RTC */
#if defined(RCC_LSE_SUPPORT)
#define RCC_RTCCLKSOURCE_LSE           RCC_BDCR_RTCSEL_0                                                   /*!< LSE oscillator clock used as RTC clock */
#endif
#define RCC_RTCCLKSOURCE_LSI           RCC_BDCR_RTCSEL_1                                                   /*!< LSI oscillator clock used as RTC clock */
#if defined(RCC_HSE_SUPPORT)
#define RCC_RTCCLKSOURCE_HSE_DIV32     (                            RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0) /*!< HSE oscillator clock divided by 32 used as RTC clock */
#define RCC_RTCCLKSOURCE_HSE_DIV128    (RCC_BDCR_RTC_HSEDIV_SEL_0 | RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0) /*!< HSE oscillator clock divided by 128 used as RTC clock */
#define RCC_RTCCLKSOURCE_HSE_DIV8      (RCC_BDCR_RTC_HSEDIV_SEL_1 | RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0) /*!< HSE oscillator clock divided by 8 used as RTC clock */
#endif
/**
  * @}
  */
#endif

/** @defgroup RCC_IWDG_Clock_Source IWDG Clock Source
  * @{
  */
#define RCC_IWDGCLKSOURCE_LSI            0x00000000U              /*!< LSI oscillator clock used as IWDG clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_IWDGCLKSOURCE_LSE            RCC_BDCR_IWDGSEL         /*!< LSE oscillator clock used as IWDG clock */
#endif
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */
#define RCC_MCO                        0x00000000U
#define RCC_MCO1                       RCC_MCO                /*!< Configure PA08 as the clock output. */
#define RCC_MCO2                       0x00000001U            /*!< Configure PA01 as the clock output. */
#define RCC_MCO3                       0x00000002U            /*!< Configure PA05 as the clock output. */
#define RCC_MCO4                       0x00000003U            /*!< Configure PA09 as the clock output. */
#define RCC_MCO5                       0x00000004U            /*!< Configure PA13 as the clock output. */
#define RCC_MCO6                       0x00000005U            /*!< Configure PA14 as the clock output. */
#define RCC_MCO7                       0x00000006U            /*!< Configure PF02 as the clock output. */
/**
  * @}
  */

/** @defgroup RCC_MCO_Clock_Source MCO Clock Source
  * @{
  */
#define RCC_MCOSOURCE_NOCLOCK         0x00000000U                                                 /*!< MCO output disabled, no clock on MCO */
#define RCC_MCOSOURCE_SYSCLK          RCC_CFGR_MCOSEL_0                                           /*!< SYSCLK selection as MCO source */
#define RCC_MCOSOURCE_HSI10M          RCC_CFGR_MCOSEL_1                                           /*!< HSI10M selection as MCO source */
#define RCC_MCOSOURCE_HSI             (RCC_CFGR_MCOSEL_1 | RCC_CFGR_MCOSEL_0)                     /*!< HSI selection as MCO source */
#if defined(RCC_HSE_SUPPORT)
#define RCC_MCOSOURCE_HSE             RCC_CFGR_MCOSEL_2                                           /*!< HSE selection as MCO source */
#endif
#if defined(RCC_PLL_SUPPORT)
#define RCC_MCOSOURCE_PLL             (RCC_CFGR_MCOSEL_2 | RCC_CFGR_MCOSEL_0)                     /*!< PLL selection as MCO source */
#endif
#define RCC_MCOSOURCE_LSI             (RCC_CFGR_MCOSEL_2 | RCC_CFGR_MCOSEL_1)                     /*!< LSI selection as MCO source */
#if defined(RCC_LSE_SUPPORT)
#define RCC_MCOSOURCE_LSE             (RCC_CFGR_MCOSEL_2 | RCC_CFGR_MCOSEL_1 | RCC_CFGR_MCOSEL_0) /*!< LSE selection as MCO source */
#endif
#define RCC_MCOSOURCE_HCLK            RCC_CFGR_MCOSEL_3                                           /*!< HCLK selection as MCO source */
#define RCC_MCOSOURCE_PCLK            (RCC_CFGR_MCOSEL_3 | RCC_CFGR_MCOSEL_0)                     /*!< PCLK selection as MCO source */
#define RCC_MCOSOURCE_HCLK_UNGATE     (RCC_CFGR_MCOSEL_3 | RCC_CFGR_MCOSEL_1)                     /*!< HCLK without gate selected as MCO source */
#define RCC_MCOSOURCE_PCLK_UNGATE     (RCC_CFGR_MCOSEL_3 | RCC_CFGR_MCOSEL_1 | RCC_CFGR_MCOSEL_0) /*!< PCLK without gate selected as MCO source */
/**
  * @}
  */

/** @defgroup RCC_MCO_Clock_Prescaler MCO Clock Prescaler
  * @{
  */
#define RCC_MCODIV_1                   0x00000000U                                                                     /*!< MCO not divided */
#define RCC_MCODIV_2                   (RCC_CFGR_MCOPRE_3)                                                             /*!< MCO divided by 2 */
#define RCC_MCODIV_4                   (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_0)                                         /*!< MCO divided by 4 */
#define RCC_MCODIV_8                   (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_1)                                         /*!< MCO divided by 8 */
#define RCC_MCODIV_16                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_1 | RCC_CFGR_MCOPRE_0)                     /*!< MCO divided by 16 */
#define RCC_MCODIV_32                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2)                                         /*!< MCO divided by 32 */
#define RCC_MCODIV_64                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_0)                     /*!< MCO divided by 64 */
#define RCC_MCODIV_128                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_1)                     /*!< MCO divided by 128 */
#define RCC_MCODIV_256                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_1 | RCC_CFGR_MCOPRE_0) /*!< MCO divided by 256 */
/**
  * @}
  */

/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_IT_LSIRDY                    ((uint32_t)RCC_CIFR_LSIRDYF)   /*!< LSI Ready Interrupt flag */
#if defined(RCC_LSE_SUPPORT)
#define RCC_IT_LSERDY                    ((uint32_t)RCC_CIFR_LSERDYF)   /*!< LSE Ready Interrupt flag */
#endif
#define RCC_IT_HSIRDY                    ((uint32_t)RCC_CIFR_HSIRDYF)   /*!< HSI Ready Interrupt flag */
#if defined(RCC_HSE_SUPPORT)
#define RCC_IT_HSERDY                    ((uint32_t)RCC_CIFR_HSERDYF)   /*!< HSE Ready Interrupt flag */
#endif
#if defined(RCC_PLL_SUPPORT)
#define RCC_IT_PLLRDY                    ((uint32_t)RCC_CIFR_PLLRDYF)   /*!< PLL Ready Interrupt flag */
#endif
#if defined(RCC_HSE_SUPPORT)
#define RCC_IT_CSS                       ((uint32_t)RCC_CIFR_CSSF)      /*!< Clock Security System Interrupt flag */
#endif
#if defined(RCC_LSE_SUPPORT)
#define RCC_IT_LSECSS                    ((uint32_t)RCC_CIFR_LSECSSF)   /*!< LSE Clock Security System Interrupt flag */
#endif
/**
  * @}
  */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: CSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_HSIRDY                  ((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_Pos)) /*!< Internal High Speed clock ready flag */
#if defined(RCC_HSE_SUPPORT)
#define RCC_FLAG_HSERDY                  ((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos)) /*!< External High Speed clock ready flag */
#endif
#if defined(RCC_PLL_SUPPORT)
#define RCC_FLAG_PLLRDY                  ((uint8_t)((CR_REG_INDEX << 5U) | RCC_CR_PLLRDY_Pos)) /*!< PLL clock ready flag */
#endif

/* Flags in the BDCR register */
#if defined(RCC_LSE_SUPPORT)
#define RCC_FLAG_LSERDY                  ((uint8_t)((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_Pos))  /*!< External Low Speed oscillator Ready */
#define RCC_FLAG_LSECSSD                 ((uint8_t)((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSECSSD_Pos)) /*!< LSE Clock Security System Interrupt flag */
#endif

